Repository: 0lmer/openprocurement.api
Catalog: docs/source/locale/*/LC_MESSAGES/2pc.po
Languages: uk

source: 2 Phase Commit
uk: Двофазний коміт

source: The 2-phase commit provides a mechanism for CDB to publish only the tenders that clients are able to control and duplicates of which they have rights to cancel.
uk: Двофазний коміт пропонує механізм, завдяки якому в ЦБД будуть опубліковані тільки ті закупівлі, над якими майданчик має контроль і змогу самостійно скасувати їх дублікати.

source: The reason for duplicated tenders can be cases when the requester did not receive a response from the server about tender creation and, therefore, repeated the request. Removing such tenders requires administrative intervention.
uk: Причиною виникнення дублікатів закупівель є ситуації, коли автор запиту на створення закупівлі не отримував відповіді від сервера про її створення, і, відповідно, повторював спробу, що призводило до дублювання закупівлі. Видалення таких закупівель вимагало адміністративного втручання.

source: Creating tender with 2 Phase Commit
uk: Створення закупівлі за допомогою двофазного коміта

source: Sending a single-phase request for a tender creation (POST /tenders) according to the "old" mechanism, that creates a tender already in the ``active.enquiries`` status:
uk: Відсилання однофазного запиту на створення закупівлі (`POST /tenders`), за “старим” механізмом, після якого закупівля створюється одразу в статусі ``active.enquiries``:

source: Mechanism of the 2-phase commit
uk: Механізм створення двофазного коміта

source: Tender becomes available after the successful completion of the following requests:
uk: Закупівля стає доступною після успішного та послідовного виконання двох наступних запитів:

source: Creation of the tender in the ``draft`` status.
uk: Створення закупівлі у статусі ``draft``.

source: Transfer of the tender to ``active.enquiries`` status through a separate request (publication).
uk: Переведення закупівлі в статус ``active.enquiries`` окремим запитом (публікація).

source: Creation of a tender
uk: Створення закупівлі

source: A request `POST /tenders` creates a tender in status ``draft``. As a result, an ``acc_token`` is passed for the further tender management.
uk: При запиті `POST /tenders` передається закупівля зі статусом ``draft``. В результаті виконання запиту віддається ``acc_token`` для подальшого управління закупівлею.

source: Validation rules in the ``draft`` status:
uk: Правила валідації в статусі ``draft``:

source: ``enquiryPeriod.startDate`` can be empty;
uk: ``enquiryPeriod.startDate`` може бути порожнім;

source: ``enquiryPeriod.startDate`` can not be in the past;
uk: ``enquiryPeriod.startDate`` не може бути в минулому;

source: ``enquiryPeriod.startDate`` is not automatically generated.
uk: ``enquiryPeriod.startDate`` не генерується автоматично.

source: Tender with the ``draft`` status is "invisible" in the `GET /tenders` list. Chronograph does not "see" it, therefore, does not switch statuses.
uk: Закупівля зі статусом ``draft`` "невидима" в переліку `GET /tenders`. Її, зокрема, не помічає хронограф і не перемикає статуси.

source: Publication of a tender
uk: Публікування закупівлі

source: The request `PATCH /tenders/{id}?acc_token=...` ``{“data”:{“status”:”active.enquiries”}}`` executes the following:
uk: Запит `PATCH /tenders/{id}?acc_token=...` ``{“data”:{“status”:”active.enquiries”}}`` здійснює наступне:

source: If the field ``enquiryPeriod.startDate`` is empty, fills it out with the current time. If the date is in the past, it declines publication indicating that the beginning of the Questions and Answers (enquiries) period can not start in the past.
uk: Якщо поле ``enquiryPeriod.startDate`` порожнє, то заповнює поточним часом. Якщо дата в минулому - відмовляє в публікації вказуючи, що дата початку періоду питань-відповідей не може бути в минулому.

source: Generates ``tender_id`` with regard to ``enquiryPeriod.startDate``.
uk: Генерується ``tender_id`` із врахуванням ``enquiryPeriod.startDate``.

source: Changes status of tender (according to the request), therefore, publishes it ("visualizes" it in the `GET /tenders list`).
uk: Змінює статус закупівлі (згідно із запитом) і, відповідно, цим публікує його (“візуалізує” його в переліку `GET /tenders`).

source: All tenders created in the CDB but not yet published will not be displayed on the web platform and, therefore, will not lead to their announcement.
uk: Всі закупівлі, які були створені в ЦБД, але не опубліковані, не будуть відображатись на майданчику і, відповідно, не будуть призводити до їх оголошення.

source: Repeating of the request for publication in case of problem with receiving a response from the server will not cause errors.
uk: Повторення запиту на публікацію, у випадку проблем з отриманням відповіді від сервера, не буде спричиняти помилок.

source: The new mechanism is available along with the "old" one. The "old" is likely to be turned off in one of the later releases.
uk: Новий механізм доступний паралельно зі “старим”. “Старий”, імовірно, буде вимкнено в одному з наступних release-ів.

source: Example of incorrectly formed request error
uk: Приклад помилки неправильно сформованого запиту

source: Error indicates that the data is not found in the body of JSON.
uk: Помилка вказує, що `data` не знайдено у тілі JSON.
