Repository: 0lmer/openprocurement.api
Catalog: docs/source/locale/*/LC_MESSAGES/meat.po
Languages: uk

source: Most economically advantageous tenders (MEAT)
uk: Закупівлі за принципом найбільш економічно вигідної пропозиції

source: Announcing MEAT
uk: Оголошення закупівлі з неціновими критеріями

source: Bidding in MEAT
uk: Подання пропозицій до закупівлі з неціновими критеріями

source: Qualification in MEAT
uk: Кваліфікація у закупівлі з неціновими критеріями

source: Besides simple price-only tenders it is possible to announce the tender where other factors are valuable. Such tenders define features that procuring entity is interested in and how much different options influence the decision about the winner. Features can describe properties of tenderer, lot or item(s) being procured. Each option offered has numerical value that defines level of its importance compared to price. Bidders are doing self evaluation and provide the Parameters of their proposal (the actual value of each feature) along with financial part of a bid.
uk: Крім звичайних закупівель, що базуються на ціні, є можливість оголосити закупівлю, що бере до уваги і інші фактори. Такі закупівлі визначають показники, в яких зацікавлений замовник, та наскільки різні критерії впливають на вибір переможця. Критерії можуть описувати властивості учасників, лота чи товарів/послуг, що закуповуються. Кожен критерій має числове значення, що визначає його важливість в порівнянні з ціною. Учасники проводять власну оцінку та надають Параметри своїх пропозицій (дійсне значення кожного критерію) разом із фінансовою частиною своєї пропозиції.

source: The :ref:`Feature` is a data structure, part of the :ref:`Tender`. Tender can have multiple features associated. Feature can be associated with tenderer, lot or individual Item being procured. Features are identified with code, which are unique within the tender.
uk: :ref:`Feature` (критерій) - структура даних, частина :ref:`Tender`. Закупівля Tender може мати багато критеріїв Feature, пов’язаних з нею. Критерій може бути пов’язаний з учасником, лотом чи окремим товаром/послугою, що закуповується. Критерії ідентифікуються за допомогою кодів, що є унікальними в межах тендера.

source: :ref:`Parameters <parameter>` provided by :ref:`bidders <Bid>` should correspond to a set of required features. Parameters are linked to features using their codes.
uk: :ref:`Параметри <parameter>`, що надаються :ref:`учасниками <Bid>`, повинні відповідати набору необхідних критеріїв. Параметри поєднуються з критеріями за допомогою їхніх кодів.

source: Features can be set in :ref:`Tender` pretty the :ref:`same way <procuring>` as Items are: initially with POST request and later modified with PATCH requests.
uk: Features (критерії) можуть бути встановлені для :ref:`Tender` майже :ref:`тим самим способом<procuring>`, що і Items: спочатку потрібно створити їх POST запитом, а потім можна модифікувати PATCH запитами.

source: The same applies to :ref:`Bid` - Parameters of a Bid can be set initially with POST request and modified later with PATCH requests (see more at :ref:`bidding`).
uk: Те саме стосується і цінових пропозицій :ref:`Bid` - Параметри пропозиції можуть бути створені POST запитом, а потім модифіковані PATCH запитами (більше в :ref:`bidding`).

source: During auction Bidder can bid with his/her bid price and see normalized price of his/her bid against normalized bids of other bidders. Ranking in auction is performed with normalized price where both price value and other `Bid.parameters` are taken into consideration.
uk: Під час аукціону учасник може подавати свою цінову пропозицію і бачити приведену ціну своєї пропозиції проти приведених цін пропозицій інших учасників. Рангування в аукціоні відбувається за приведеними цінами, в яких береться до уваги і цінова пропозиція, і інші нецінові критерії (`Bid.parameters`).
