Repository: 0lmer/openprocurement.api
Catalog: docs/source/locale/*/LC_MESSAGES/reference.po
Languages: uk

source: API Reference
uk: API Довідник

source: Open Contracting compatible data exchange format. See http://ocds.open-contracting.org/standard/r/master/#tender for more info
uk: Open Contracting сумісний формат обміну даними. Більше на http://ocds.open-contracting.org/standard/r/master/#tender

source: This API request is targeted to creating new Tenders by procuring organizations.
uk: Цей API запит орієнтований на створення нових Закупівель замовниками.

source: Creating new Tender
uk: Створення нової Закупівлі

source: Example request to create tender:
uk: Приклад запиту для створення закупівлі:

source: This is what one should expect in response:
uk: Так повинна виглядати відповідь:

source: Tender Read
uk: Читати Закупівлю

source: Tender Edit (full)
uk: Редагувати Закупівлю (повністю)

source: Tender Edit (partial)
uk: Редагувати Закупівлю (частково)

source: For example here is how procuring entity can change number of items to be procured and total Value of a tender:
uk: Наприклад, ось так замовник закупівлі може змінити об’єм та загальну Вартість закупівлі:

source: And here is the response to be expected:
uk: Відповідь буде такою:

source: Tender related binary files (PDFs, etc.)
uk: Двійкові файли пов’язані із закупівлею (.PDF документи і т.п.)

source: Tender Documents List
uk: Список документів Закупівлі

source: Tender Document Upload
uk: Завантажити документ Закупівлі

source: Tender Document Read
uk: Читати документ Закупівлі

source: Tender Document Update
uk: Оновити документ Закупівлі

source: Get auction info.
uk: Отримати інформацію про аукціон.

source: Get tender auction info
uk: Отримати інформацію про аукціон.

source: Example request to get tender auction information:
uk: Приклад запиту для отримання інформації про аукціон:

source: Report auction results.
uk: Звітувати про результати аукціону.

source: Report auction results
uk: Звітувати про результати аукціону

source: Example request to report auction results:
uk: Приклад запиту звіту про результати аукціону:

source: Tenders List
uk: Список закупівель

source: Get Tenders List
uk: Прочитати список закупівель

source: Example request to get tenders list:
uk: Приклад запиту для вичитки списку закупівель:

source: Get Tender
uk: Прочитати Закупівлю

source: Example request to get tender:
uk: Приклад запиту для вичитки Закупівлі

source: Tender bidders
uk: Учасники закупівлі

source: Registration of new bid proposal
uk: Реєстрація нової пропозиції

source: Creating new Bid proposal
uk: Створення нової пропозиції

source: Example request to create bid proposal:
uk: Приклад запиту для створення нової пропозиції:

source: Tender bidder documents
uk: Документи учасника закупівлі

source: Tender Bid Document Upload
uk: Завантажити документи учасника закупівлі

source: Tender awards
uk: Переможці Закупівлі

source: Accept or reject bidder application
uk: Прийняти або відхилити заявку учасника

source: Creating new Award
uk: Створення нового Переможця

source: Example request to create award:
uk: Приклад запиту для створення переможця

source: Bids Listing
uk: Список пропозицій

source: Get Bids List
uk: Прочитати список пропозицій

source: Example request to get bids list:
uk: Приклад запиту для вичитки списку пропозицій

source: Retrieving the proposal
uk: Вичитка пропозиції

source: Example request for retrieving the proposal:
uk: Приклад запиту для вичитки пропозиції

source: Cancelling the proposal
uk: Відміна пропозиції

source: Example request for cancelling the proposal:
uk: Приклад запиту для відміни пропозиції

source: Update of proposal
uk: Оновлення пропозиції

source: Example request to change bid proposal:
uk: Приклад запиту для оновлення цінової пропозиції

source: Tender Bid Documents List
uk: Список документів пропозиції

source: Tender Bid Document Read
uk: Читати документи пропозиції

source: Tender Bid Document Update
uk: Оновити документи пропозиції
