Repository: 0lmer/openprocurement.api
Catalog: docs/source/locale/*/LC_MESSAGES/tenders.po
Languages: uk

source: Retrieving Tender Information
uk: Отримання інформації про закупівлі

source: Getting list of all tenders
uk: Отримати список всіх закупівель

source: Reading the individual tender information
uk: Прочитати інформацію про окремі закупівлі

source: Reading the tender documents list
uk: Прочитати список документів закупівлі

source: Reading the tender document
uk: Прочитати документ закупівлі

source: The document can be retrieved by requesting the url returned in structures from document list request in `data[*].url`. It is safe to provide the download URL to end user for download.
uk: Документ можна отримати за допомогою запиту url-адреси з відповіді на запит списку документів у `data[*].url`. URL для скачування безпечно надавати кінцевому користувачу.

source: Sorting
uk: Сортування

source: Tenders retuned are sorted by modification time.
uk: Повернені закупівлі просортовані за датою модифікації.

source: Limiting number of Tenders returned
uk: Обмежити кількість Закупівель, що повертаються

source: Batching
uk: Пакети

source: The response contains `next_page` element with following properties:
uk: Відповідь містить елемент `next_page` з такими властивостями:

source: This is the parameter you have to add to the original request you made to get next page.
uk: Це параметр, який ви повинні додати до вихідного запиту, щоб отримати наступну сторінку.

source: The full version of URL for next page.
uk: Повна версія URL-адреси для наступної сторінки.

source: If next page request returns no data (i.e. empty array) then there is little sense in fetching further pages.
uk: Якщо запит наступної сторінки повертається без даних (наприклад, пустий масив), тоді немає сенсу викликати сторінки далі.

source: Synchronizing
uk: Синхронізація

source: The safe frequency of synchronization requests is once per 5 minutes.
uk: Безпечна частота запитів на синхронізацію це раз в 5 хвилин.

source: Example request:
uk: Приклад запиту:

source: You can control the number of `data` entries in the tenders feed (batch size) with `limit` parameter. If not specified, data is being returned in batches of 100 elements.
uk: Ви можете контролювати кількість `data` записів потоку даних закупівлі (розмір пакета) за допомогою параметра `limit`. Якщо він не вказаний, то дані будуть повернені пакетами по 100 елементів.

source: This is path section of URL with original parameters and `offset` parameter added/replaced above.
uk: Це частина шляху URL-адреси з вихідними параметрами та доданим/заміненим `offset` параметром вище.

source: It is often necessary to be able to syncronize central database changes to other database (we'll call it "local"). The default sorting "by modification date" altogether by Batching mechanism allows one to implement synchronization effectively. The synchronization process can go page by page until there is no new data returned. Then the synchronizer have to pause for a while to let central database register some changes and attempt fetching subsequent page. The `next_page` guarantees to have all changes from the last request to be included in new batch.
uk: Часто необхідно мати можливість синхронізувати зміни центральної бази даних з іншою базою даних (ми будемо називати її "локальною"). Стандартне сортування "за датою модифікації" разом із механізмом пакетування дозволяє ефективно здійснювати синхронізацію. Процес синхронізації може виконуватись посторінково, поки не буде жодних нових даних, що повертаються. Тоді синхронізатор призупиниться на деякий час, щоб дозволити центральній базі даних зареєструвати деякі зміни і спробувати завантажити наступну сторінку. `next_page` гарантує, що усі зміни з останнього запиту будуть включені у новий пакет.
